# How to  select a part of a Given DataFrame
与えられたDataFrameの一部のviewを取得する方法をまとめる。

In [1]:
import pandas as pd

In [2]:
origin = pd.read_csv("test.csv", sep=",",)

In [9]:
origin.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## 列(及び行)の選択による方法

In [4]:
sex = origin.loc[:,"Sex"]
sex.head(5)

0      male
1    female
2      male
3      male
4    female
Name: Sex, dtype: object

In [5]:
pid_sex = origin.loc[:,["PassengerId","Sex"]]
pid_sex.head(5)

   PassengerId     Sex
0          892    male
1          893  female
2          894    male
3          895    male
4          896  female

## 特定の列の値を別の値に書き換える
[ToUnderStand] 何故DataFrameのviewだと元オブジェクトは影響を受けず、Seriesのviewだと元オブジェクトは影響を受けるのか？

male -> 0, female -> 1

In [6]:
pid_sex.loc[pid_sex.loc[:,"Sex"] == "male", "Sex"] = 0
pid_sex.loc[pid_sex.loc[:,"Sex"] == "female", "Sex"] = 1
pid_sex.head(5)

   PassengerId Sex
0          892   0
1          893   1
2          894   0
3          895   0
4          896   1

In [8]:
sex.loc[sex.loc[:] == "male"] = 0

C:\Users\Yuki\Anaconda3\lib\site-packages\pandas\core\indexing.py:179: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

## データ型による選択の方法

In [12]:
numeric = origin.select_dtypes(exclude=["object"])
numeric.head(5)

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0          892       3  34.5      0      0   7.8292
1          893       3  47.0      1      0   7.0000
2          894       2  62.0      0      0   9.6875
3          895       3  27.0      0      0   8.6625
4          896       3  22.0      1      1  12.2875

In [13]:
non_numeric = origin.select_dtypes(include=["object"])
non_numeric.head(5)

,Name,Sex,Ticket,Cabin,Embarked
0,"Kelly, Mr. James",0,330911,NaN,Q
1,"Wilkes, Mrs. James (Ellen Needs)",female,363272,NaN,S
2,"Myles, Mr. Thomas Francis",0,240276,NaN,Q
3,"Wirz, Mr. Albert",0,315154,NaN,S
4,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,3101298,NaN,S